# -*- coding: utf-8 -*-
###############################################################################
# モデル：システム
# Copyright:: Copyright (c) 2011 仲観派
# 作成日:2011/08/09 Nakanohito
# 更新日:
###############################################################################
class System < AccessManagementSuper
  #############################################################################
  # 更新項目設定
  #############################################################################
  attr_accessible :system_name, :subsystem_name
  #############################################################################
  # リレーション設定
  #############################################################################
  # 機能
  has_many :function
  # リクエスト解析スケジュール
  has_many :request_analysis_schedule
  # リクエスト解析結果
  has_many :request_analysis_result
  # 規制ホスト
  has_many :regulation_host
  # 規制クッキー
  has_many :regulation_cookie
  # 規制リファラー
  has_many :regulation_referrer
  
  #############################################################################
  # バリデーション定義
  #############################################################################
  validates :system_name,
    :presence => true,
    :length => {:maximum => 255}
  validates :subsystem_name,
    :allow_nil => true,
    :length => {:maximum => 255}
end
