# -*- coding: utf-8 -*-
###############################################################################
# モデル：機能
# Copyright:: Copyright (c) 2011 仲観派
# 作成日:2011/08/09 Nakanohito
# 更新日:
###############################################################################
class Function < AccessManagementSuper
  #############################################################################
  # 更新項目設定
  #############################################################################
  attr_accessible :system_id, :function_path, :function_name
  
  #############################################################################
  # リレーション設定
  #############################################################################
  # システム
  belongs_to :system
  # リクエスト解析結果
  has_many :request_analysis_result
  
  #############################################################################
  # バリデーション定義
  #############################################################################
  validates :system_id,
    :presence => true
  validates :function_path,
    :presence => true,
    :length => {:maximum => 255}
  validates :function_name,
    :presence => true,
    :length => {:maximum => 255}
  #############################################################################
  # publicメソッド定義
  #############################################################################
  public
  # 機能パス判定
  def function_path?(path)
    return false unless String === path
    reg_patten = Regexp.new("^" + Regexp.escape(function_path) + "([\/\?].*)?$")
    return !(reg_patten =~ path).nil?
  end
  
end
