# -*- coding: utf-8 -*-
###############################################################################
# モデル：権限
# Copyright:: Copyright (c) 2011 仲観派
# 作成日:2012/10/31 Nakanohito
# 更新日:
###############################################################################
class Authority < ActiveRecord::Base
  #############################################################################
  # 更新項目設定
  #############################################################################
  attr_accessible :authority_cls, :authority, :authority_simple, :lock_version
  
  #############################################################################
  # 定数定義
  #############################################################################
  # 権限（一般会員）
  AUTHORITY_CLS_GENERAL = 'GEN'
  # 権限（管理者）
  AUTHORITY_CLS_ADMIN   = 'ADM'
  
  #############################################################################
  # バリデーション定義
  #############################################################################
  validates :authority_cls,
    :presence => true,
    :length => {:is => 3}
  validates :authority,
    :allow_nil => true,
    :length => {:maximum => 255}
  validates :authority_simple,
    :allow_nil => true,
    :length => {:maximum => 255}
end
