# -*- coding: utf-8 -*-
###############################################################################
# モデル：データ更新
# Copyright:: Copyright (c) 2011 仲観派
# 作成日:2012/11/30 Nakanohito
# 更新日:
###############################################################################

class DataUpdated < ActiveRecord::Base
  #############################################################################
  # 更新項目設定
  #############################################################################
  attr_accessible :data_key, :data_update_version, :lock_version

  #############################################################################
  # バリデーション定義
  #############################################################################
  validates :data_key,
    :presence => true,
    :length => {:maximum => 255}
  validates :data_update_version,
    :presence => true
end
