# -*- coding: utf-8 -*-
###############################################################################
# モデル：性別
# Copyright:: Copyright (c) 2011 仲観派
# 作成日:2012/10/31 Nakanohito
# 更新日:
###############################################################################
class Gender < ActiveRecord::Base
  #############################################################################
  # 更新項目設定
  #############################################################################
  attr_accessible :gender_cls, :gender, :gender_simple, :lock_version
  #############################################################################
  # 定数定義
  #############################################################################
  # 性別区分（男性）
  GENDER_CLS_MAN    = 'M'
  # 性別区分（女性）
  GENDER_CLS_FEMALE = 'F'
  
  #############################################################################
  # バリデーション定義
  #############################################################################
  validates :gender_cls,
    :presence => true,
    :length => {:is => 1}
  validates :gender,
    :presence => true,
    :length => {:maximum => 255}
  validates :gender_simple,
    :presence => true,
    :length => {:maximum => 255}
  
end
