# -*- coding: utf-8 -*-
###############################################################################
# モデル：言語
# Copyright:: Copyright (c) 2011 仲観派
# 作成日:2012/10/31 Nakanohito
# 更新日:
###############################################################################
class Language < ActiveRecord::Base
  #############################################################################
  # 更新項目設定
  #############################################################################
  attr_accessible :lang_name_cd, :lang_name, :name_notation_cls, :lock_version
  
  #############################################################################
  # 定数定義
  #############################################################################
  # 氏名表記区分（姓名）
  NOTATION_CLS_LF = 'LF'
  # 氏名表記区分（名姓）
  NOTATION_CLS_FL = 'FL'
  
  #############################################################################
  # バリデーション定義
  #############################################################################
  validates :lang_name_cd,
    :presence => true,
    :length => {:is => 2}
  validates :lang_name,
    :presence => true,
    :length => {:maximum => 255}
  validates :name_notation_cls,
    :presence => true,
    :length => {:is => 2}
end
