# -*- coding: utf-8 -*-
###############################################################################
# モデル：OpenIDナンス
# Copyright:: Copyright (c) 2011 仲観派
# 作成日:2012/10/31 Nakanohito
# 更新日:
###############################################################################
class OpenIdNonce < ActiveRecord::Base
  #############################################################################
  # 更新項目設定
  #############################################################################
  attr_accessible :server_url, :salt, :timestamp, :lock_version
  
  #############################################################################
  # バリデーション定義
  #############################################################################
  validates :server_url,
    :presence => true
  validates :salt,
    :presence => true
  validates :timestamp,
    :presence => true
end
