# -*- coding: utf-8 -*-
###############################################################################
# モデル：退会者状態
# Copyright:: Copyright (c) 2011 仲観派
# 作成日:2012/10/31 Nakanohito
# 更新日:
###############################################################################
class PersonWithdrawalState < ActiveRecord::Base
  #############################################################################
  # 更新項目設定
  #############################################################################
  attr_accessible :person_withdrawal_state_cls, :person_withdrawal_state, :lock_version
  
  #############################################################################
  # 定数定義
  #############################################################################
  # 退会者状態区分（退会済み）
  STATE_CLS_PRE_WITHDRAWAL    = 'PRW'
  # 退会者状態区分（個人情報削除済み）
  STATE_CLS_DEL_PERSONAL_INFO = 'DPI'
  
  #############################################################################
  # リレーション設定
  #############################################################################
  # 退会者
  has_many :person_withdrawal
  
  #############################################################################
  # バリデーション定義
  #############################################################################
  validates :person_withdrawal_state_cls,
    :presence => true,
    :length => {:is => 3}
  validates :person_withdrawal_state,
    :presence => true,
    :length => {:maximum => 255}
end
