###############################################################################
# 郵便番号クラス
# Copyright:: Copyright (c) 2011 仲務省
# 作成日:2011/06/25 Nakanohito  (mailto:)
# 更新日:
###############################################################################
class Postcode < ActiveRecord::Base
  #############################################################################
  # バリデーション定義
  #############################################################################
  validates :postcode,
    :presence => {:message => 'は必須です'},
    :length => {:is => 7, :wrong_length => 'は%{count}桁でなければなりません'}
end
