# -*- coding: utf-8 -*-
###############################################################################
# モデル：タイムゾーン
# Copyright:: Copyright (c) 2011 仲観派
# 作成日:2012/10/31 Nakanohito
# 更新日:
###############################################################################
class Timezone < ActiveRecord::Base
  #############################################################################
  # 更新項目設定
  #############################################################################
  attr_accessible :timezone_id, :timezone_name, :lock_version
  
  #############################################################################
  # バリデーション定義
  #############################################################################
  validates :timezone_id,
    :presence => true,
    :length => {:maximum => 255}
  validates :timezone_name,
    :allow_nil => true,
    :length => {:maximum => 255}
end
