# -*- coding: utf-8 -*-
###############################################################################
# モデル：退会理由
# Copyright:: Copyright (c) 2011 仲観派
# 作成日:2012/10/31 Nakanohito
# 更新日:
###############################################################################
class WithdrawalReason < ActiveRecord::Base
  #############################################################################
  # 更新項目設定
  #############################################################################
  attr_accessible :withdrawal_reason_cls, :withdrawal_reason, :lock_version
  
  #############################################################################
  # 定数定義
  #############################################################################
  # 退会理由（本人都合）
  REASON_CLS_PERSON_CIRCUMSTANCES = 'PSC'
  # 退会理由（他人都合）
  REASON_CLS_OTHERS_CIRCUMSTANCES = 'OTC'
  # 退会理由（会員規約違反）
  REASON_CLS_AGREEMENT_VIOLATION  = 'AGV'
  # 退会理由（法令違反）
  REASON_CLS_LAW_VIOLATION        = 'LWV'
  # 退会理由（その他）
  REASON_CLS_OTHER                = 'OTH'
  
  #############################################################################
  # リレーション設定
  #############################################################################
  # 退会者
  has_many :person_withdrawal
  
  #############################################################################
  # バリデーション定義
  #############################################################################
  validates :withdrawal_reason_cls,
    :presence => true,
    :length => {:is => 3}
  validates :withdrawal_reason,
    :presence => true,
    :length => {:maximum => 255}
end
