# -*- coding: utf-8 -*-
###############################################################################
# 業務プロセスクラス
# 概要：バックグラウンドスレッドで実行するプロセスの基底クラス
# Copyright:: Copyright (c) 2011 仲観派
# 作成日:2012/12/08 Nakanohito
# 更新日:
###############################################################################

module BizProcess
  class BusinessProcess
    attr_reader :process_name
    attr_writer :logger
    ###########################################################################
    # コンストラクタ
    ###########################################################################
    def initialize(process_name=self.class.name)
      @process_name = process_name
      # エラーメッセージ
      @logger = Rails.logger
    end
    ###########################################################################
    # publicメソッド定義
    ###########################################################################
    public
    # 処理実行
    def execution
    end
  end
end